InformationRegisters/СМГ_УволенныеСотрудникиСегодня.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СМГ_УволенныеСотрудникиСегодня</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМГ_СостояниеСотрудника</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СМГ_УволенныеСотрудникиСегодня/Ext/ManagerModule.bsl
Процедура ЗадатьСостояниеСотруднику(Сотрудник) Экспорт
	
	//1.Проверяем что сотрудник есть в регистре 
	ЕстьГуглАккаунт     = киПолучитьПредставлениеКИ(Сотрудник,Справочники.ВидыКонтактнойИнформации.GoogleАккаунт);
	СтрокаОсновнаяПочта = киПолучитьПредставлениеКИ(Сотрудник,Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
	
	Если Не ЗначениеЗаполнено(ЕстьГуглАккаунт) И Не ЗначениеЗаполнено(СтрокаОсновнаяПочта) Тогда
		Возврат
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДата(); 
	МенеджерРегистра        = РегистрыСведений.СМГ_УволенныеСотрудникиСегодня;
	ПоследняяЗаписьСтатуса  = МенеджерРегистра.ПолучитьПоследнее(ТекущаяДата,Новый Структура("Сотрудник",Сотрудник)).Статус;
	МенеджерЗаписи          = МенеджерРегистра.СоздатьМенеджерЗаписи();	
	//2.Если запись присутствует,Сравниваем ее состояние с текущим объектом
	Если ЗначениеЗаполнено(ПоследняяЗаписьСтатуса) И (ТипЗнч(ПоследняяЗаписьСтатуса) = Тип("Булево")) Тогда 
		//Если в объекте уволен но в последней записи стоит что он не уволен,
		//сперва находим запись на текущую дату и меняем ей статус,если запись не найдена 
		//создаем записьна текущую дату и присваеваем ей статус
		Если Сотрудник.ФлагУволен = (Не ПоследняяЗаписьСтатуса) Тогда	
			МенеджерЗаписи.Период    = ТекущаяДата;
			МенеджерЗаписи.Сотрудник = Сотрудник.Ссылка;
			МенеджерЗаписи.Прочитать(); 
			Если МенеджерЗаписи.Выбран() Тогда 
				МенеджерЗаписи.Статус = Сотрудник.ФлагУволен;
				МенеджерЗаписи.Записать();
			Иначе
				МенеджерЗаписи.Период    = ТекущаяДата;
				МенеджерЗаписи.Сотрудник = Сотрудник.Ссылка;
				МенеджерЗаписи.Статус    = Сотрудник.ФлагУволен;
				МенеджерЗаписи.Записать();
			КонецЕсли;	
		КонецЕсли; 		
	Иначе
		//3.Если записи нет, создаем запись на текущую дату 
		МенеджерЗаписи.Период    = ТекущаяДата;
		МенеджерЗаписи.Сотрудник = Сотрудник.Ссылка;
		МенеджерЗаписи.Статус    = Сотрудник.ФлагУволен;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
КонецПроцедуры   

Функция ПолучитьСписокНаВыгрузкуСегодня(Дата) Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Текущая.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(Предыдущая.Статус, ЛОЖЬ) КАК СтатусДо,
		|	Текущая.Статус КАК СтатусСегодня
		|ИЗ
		|	РегистрСведений.СМГ_УволенныеСотрудникиСегодня.СрезПоследних(
		|			&Дата,
		|			Период = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
		|				И Статус = ИСТИНА) КАК Текущая
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМГ_УволенныеСотрудникиСегодня.СрезПоследних(&Дата, Период < НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)) КАК Предыдущая
		|		ПО Текущая.Сотрудник = Предыдущая.Сотрудник
		|ГДЕ
		|	ЕСТЬNULL(Предыдущая.Статус, ЛОЖЬ) <> Текущая.Статус";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
Конецфункции
